In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
Query_04_df = pd.read_csv("C:\\Users\\stell\\Documents\\GitHub\\Python\\Assessment_Python_DVDRental\\Query_04\\Query_4_SQL.csv")
Query_04_df.head()

   actor_id      actor_name  total_amount
0       107  Gina_Degeneres       3129.17
1       181  Matthew_Carrey       2543.78
2       198     Mary_Keitel       2426.92
3        81  Scarlett_Damon       2403.81
4       102     Walter_Torn       2403.18

In [3]:
rev = pd.DataFrame(Query_04_df, columns=['actor_name', 'total_amount'])
print(rev)

         actor_name  total_amount
0    Gina_Degeneres       3129.17
1    Matthew_Carrey       2543.78
2       Mary_Keitel       2426.92
3    Scarlett_Damon       2403.81
4       Walter_Torn       2403.18
..              ...           ...
195     Sandra_Peck        952.36
196       Judy_Dean        904.70
197      Adam_Grant        869.46
198  Sissy_Sobieski        830.84
199       Emily_Dee        812.04

[200 rows x 2 columns]

In [4]:
sorted_actors = rev.sort_values(by='total_amount', ascending=False)

top_10_actors = sorted_actors['actor_name'].head(10).tolist()
top_10_revenues = sorted_actors['total_amount'].head(10).tolist()

for actor, revenue in zip(top_10_actors, top_10_revenues):
    print(f"{actor}: {revenue}")

Gina_Degeneres: 3129.17
Matthew_Carrey: 2543.78
Mary_Keitel: 2426.92
Scarlett_Damon: 2403.81
Walter_Torn: 2403.18
Henry_Berry: 2392.36
Christian_Akroyd: 2378.97
Angela_Witherspoon: 2357.11
Cameron_Zellweger: 2322.94
Woody_Hoffman: 2315.92